node {
  name: "Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "Placeholder_1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "mcnn/large/conv_1_9x9/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv_1_9x9/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\t\000\000\000\t\000\000\000\003\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "mcnn/large/conv_1_9x9/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv_1_9x9/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.06243905425071716
      }
    }
  }
}
node {
  name: "mcnn/large/conv_1_9x9/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv_1_9x9/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.06243905425071716
      }
    }
  }
}
node {
  name: "mcnn/large/conv_1_9x9/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "mcnn/large/conv_1_9x9/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv_1_9x9/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "mcnn/large/conv_1_9x9/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "mcnn/large/conv_1_9x9/weights/Initializer/random_uniform/max"
  input: "mcnn/large/conv_1_9x9/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv_1_9x9/weights"
      }
    }
  }
}
node {
  name: "mcnn/large/conv_1_9x9/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "mcnn/large/conv_1_9x9/weights/Initializer/random_uniform/RandomUniform"
  input: "mcnn/large/conv_1_9x9/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv_1_9x9/weights"
      }
    }
  }
}
node {
  name: "mcnn/large/conv_1_9x9/weights/Initializer/random_uniform"
  op: "Add"
  input: "mcnn/large/conv_1_9x9/weights/Initializer/random_uniform/mul"
  input: "mcnn/large/conv_1_9x9/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv_1_9x9/weights"
      }
    }
  }
}
node {
  name: "mcnn/large/conv_1_9x9/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv_1_9x9/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 9
        }
        dim {
          size: 9
        }
        dim {
          size: 3
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "mcnn/large/conv_1_9x9/weights/Assign"
  op: "Assign"
  input: "mcnn/large/conv_1_9x9/weights"
  input: "mcnn/large/conv_1_9x9/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv_1_9x9/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "mcnn/large/conv_1_9x9/weights/read"
  op: "Identity"
  input: "mcnn/large/conv_1_9x9/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv_1_9x9/weights"
      }
    }
  }
}
node {
  name: "mcnn/large/conv_1_9x9/biases/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv_1_9x9/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "mcnn/large/conv_1_9x9/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv_1_9x9/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "mcnn/large/conv_1_9x9/biases/Assign"
  op: "Assign"
  input: "mcnn/large/conv_1_9x9/biases"
  input: "mcnn/large/conv_1_9x9/biases/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv_1_9x9/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "mcnn/large/conv_1_9x9/biases/read"
  op: "Identity"
  input: "mcnn/large/conv_1_9x9/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv_1_9x9/biases"
      }
    }
  }
}
node {
  name: "mcnn/large/conv_1_9x9/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "mcnn/large/conv_1_9x9/Conv2D"
  op: "Conv2D"
  input: "Placeholder"
  input: "mcnn/large/conv_1_9x9/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "mcnn/large/conv_1_9x9/BiasAdd"
  op: "BiasAdd"
  input: "mcnn/large/conv_1_9x9/Conv2D"
  input: "mcnn/large/conv_1_9x9/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "mcnn/large/conv_1_9x9/Relu"
  op: "Relu"
  input: "mcnn/large/conv_1_9x9/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mcnn/large/Maximum/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "mcnn/large/Maximum"
  op: "Maximum"
  input: "mcnn/large/conv_1_9x9/Relu"
  input: "mcnn/large/Maximum/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mcnn/large/conv2_9x9/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv2_9x9/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\007\000\000\000\007\000\000\000\020\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "mcnn/large/conv2_9x9/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv2_9x9/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.05050762742757797
      }
    }
  }
}
node {
  name: "mcnn/large/conv2_9x9/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv2_9x9/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.05050762742757797
      }
    }
  }
}
node {
  name: "mcnn/large/conv2_9x9/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "mcnn/large/conv2_9x9/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv2_9x9/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "mcnn/large/conv2_9x9/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "mcnn/large/conv2_9x9/weights/Initializer/random_uniform/max"
  input: "mcnn/large/conv2_9x9/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv2_9x9/weights"
      }
    }
  }
}
node {
  name: "mcnn/large/conv2_9x9/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "mcnn/large/conv2_9x9/weights/Initializer/random_uniform/RandomUniform"
  input: "mcnn/large/conv2_9x9/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv2_9x9/weights"
      }
    }
  }
}
node {
  name: "mcnn/large/conv2_9x9/weights/Initializer/random_uniform"
  op: "Add"
  input: "mcnn/large/conv2_9x9/weights/Initializer/random_uniform/mul"
  input: "mcnn/large/conv2_9x9/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv2_9x9/weights"
      }
    }
  }
}
node {
  name: "mcnn/large/conv2_9x9/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv2_9x9/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 7
        }
        dim {
          size: 7
        }
        dim {
          size: 16
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "mcnn/large/conv2_9x9/weights/Assign"
  op: "Assign"
  input: "mcnn/large/conv2_9x9/weights"
  input: "mcnn/large/conv2_9x9/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv2_9x9/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "mcnn/large/conv2_9x9/weights/read"
  op: "Identity"
  input: "mcnn/large/conv2_9x9/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv2_9x9/weights"
      }
    }
  }
}
node {
  name: "mcnn/large/conv2_9x9/biases/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv2_9x9/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "mcnn/large/conv2_9x9/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv2_9x9/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "mcnn/large/conv2_9x9/biases/Assign"
  op: "Assign"
  input: "mcnn/large/conv2_9x9/biases"
  input: "mcnn/large/conv2_9x9/biases/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv2_9x9/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "mcnn/large/conv2_9x9/biases/read"
  op: "Identity"
  input: "mcnn/large/conv2_9x9/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv2_9x9/biases"
      }
    }
  }
}
node {
  name: "mcnn/large/conv2_9x9/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "mcnn/large/conv2_9x9/Conv2D"
  op: "Conv2D"
  input: "mcnn/large/Maximum"
  input: "mcnn/large/conv2_9x9/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "mcnn/large/conv2_9x9/BiasAdd"
  op: "BiasAdd"
  input: "mcnn/large/conv2_9x9/Conv2D"
  input: "mcnn/large/conv2_9x9/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "mcnn/large/conv2_9x9/Relu"
  op: "Relu"
  input: "mcnn/large/conv2_9x9/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mcnn/large/Maximum_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "mcnn/large/Maximum_1"
  op: "Maximum"
  input: "mcnn/large/conv2_9x9/Relu"
  input: "mcnn/large/Maximum_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mcnn/large/pool1_9x9/MaxPool"
  op: "MaxPool"
  input: "mcnn/large/Maximum_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "mcnn/large/conv3_9x9/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv3_9x9/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\007\000\000\000\007\000\000\000 \000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "mcnn/large/conv3_9x9/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv3_9x9/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.05050762742757797
      }
    }
  }
}
node {
  name: "mcnn/large/conv3_9x9/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv3_9x9/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.05050762742757797
      }
    }
  }
}
node {
  name: "mcnn/large/conv3_9x9/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "mcnn/large/conv3_9x9/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv3_9x9/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "mcnn/large/conv3_9x9/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "mcnn/large/conv3_9x9/weights/Initializer/random_uniform/max"
  input: "mcnn/large/conv3_9x9/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv3_9x9/weights"
      }
    }
  }
}
node {
  name: "mcnn/large/conv3_9x9/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "mcnn/large/conv3_9x9/weights/Initializer/random_uniform/RandomUniform"
  input: "mcnn/large/conv3_9x9/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv3_9x9/weights"
      }
    }
  }
}
node {
  name: "mcnn/large/conv3_9x9/weights/Initializer/random_uniform"
  op: "Add"
  input: "mcnn/large/conv3_9x9/weights/Initializer/random_uniform/mul"
  input: "mcnn/large/conv3_9x9/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv3_9x9/weights"
      }
    }
  }
}
node {
  name: "mcnn/large/conv3_9x9/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv3_9x9/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 7
        }
        dim {
          size: 7
        }
        dim {
          size: 32
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "mcnn/large/conv3_9x9/weights/Assign"
  op: "Assign"
  input: "mcnn/large/conv3_9x9/weights"
  input: "mcnn/large/conv3_9x9/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv3_9x9/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "mcnn/large/conv3_9x9/weights/read"
  op: "Identity"
  input: "mcnn/large/conv3_9x9/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv3_9x9/weights"
      }
    }
  }
}
node {
  name: "mcnn/large/conv3_9x9/biases/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv3_9x9/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "mcnn/large/conv3_9x9/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv3_9x9/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "mcnn/large/conv3_9x9/biases/Assign"
  op: "Assign"
  input: "mcnn/large/conv3_9x9/biases"
  input: "mcnn/large/conv3_9x9/biases/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv3_9x9/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "mcnn/large/conv3_9x9/biases/read"
  op: "Identity"
  input: "mcnn/large/conv3_9x9/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv3_9x9/biases"
      }
    }
  }
}
node {
  name: "mcnn/large/conv3_9x9/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "mcnn/large/conv3_9x9/Conv2D"
  op: "Conv2D"
  input: "mcnn/large/pool1_9x9/MaxPool"
  input: "mcnn/large/conv3_9x9/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "mcnn/large/conv3_9x9/BiasAdd"
  op: "BiasAdd"
  input: "mcnn/large/conv3_9x9/Conv2D"
  input: "mcnn/large/conv3_9x9/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "mcnn/large/conv3_9x9/Relu"
  op: "Relu"
  input: "mcnn/large/conv3_9x9/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mcnn/large/Maximum_2/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "mcnn/large/Maximum_2"
  op: "Maximum"
  input: "mcnn/large/conv3_9x9/Relu"
  input: "mcnn/large/Maximum_2/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mcnn/large/pool2_9x9/MaxPool"
  op: "MaxPool"
  input: "mcnn/large/Maximum_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "mcnn/large/conv4_9x9/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv4_9x9/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\007\000\000\000\007\000\000\000\020\000\000\000\010\000\000\000"
      }
    }
  }
}
node {
  name: "mcnn/large/conv4_9x9/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv4_9x9/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.0714285746216774
      }
    }
  }
}
node {
  name: "mcnn/large/conv4_9x9/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv4_9x9/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0714285746216774
      }
    }
  }
}
node {
  name: "mcnn/large/conv4_9x9/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "mcnn/large/conv4_9x9/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv4_9x9/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "mcnn/large/conv4_9x9/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "mcnn/large/conv4_9x9/weights/Initializer/random_uniform/max"
  input: "mcnn/large/conv4_9x9/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv4_9x9/weights"
      }
    }
  }
}
node {
  name: "mcnn/large/conv4_9x9/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "mcnn/large/conv4_9x9/weights/Initializer/random_uniform/RandomUniform"
  input: "mcnn/large/conv4_9x9/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv4_9x9/weights"
      }
    }
  }
}
node {
  name: "mcnn/large/conv4_9x9/weights/Initializer/random_uniform"
  op: "Add"
  input: "mcnn/large/conv4_9x9/weights/Initializer/random_uniform/mul"
  input: "mcnn/large/conv4_9x9/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv4_9x9/weights"
      }
    }
  }
}
node {
  name: "mcnn/large/conv4_9x9/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv4_9x9/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 7
        }
        dim {
          size: 7
        }
        dim {
          size: 16
        }
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "mcnn/large/conv4_9x9/weights/Assign"
  op: "Assign"
  input: "mcnn/large/conv4_9x9/weights"
  input: "mcnn/large/conv4_9x9/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv4_9x9/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "mcnn/large/conv4_9x9/weights/read"
  op: "Identity"
  input: "mcnn/large/conv4_9x9/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv4_9x9/weights"
      }
    }
  }
}
node {
  name: "mcnn/large/conv4_9x9/biases/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv4_9x9/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "mcnn/large/conv4_9x9/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv4_9x9/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "mcnn/large/conv4_9x9/biases/Assign"
  op: "Assign"
  input: "mcnn/large/conv4_9x9/biases"
  input: "mcnn/large/conv4_9x9/biases/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv4_9x9/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "mcnn/large/conv4_9x9/biases/read"
  op: "Identity"
  input: "mcnn/large/conv4_9x9/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/large/conv4_9x9/biases"
      }
    }
  }
}
node {
  name: "mcnn/large/conv4_9x9/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "mcnn/large/conv4_9x9/Conv2D"
  op: "Conv2D"
  input: "mcnn/large/pool2_9x9/MaxPool"
  input: "mcnn/large/conv4_9x9/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "mcnn/large/conv4_9x9/BiasAdd"
  op: "BiasAdd"
  input: "mcnn/large/conv4_9x9/Conv2D"
  input: "mcnn/large/conv4_9x9/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "mcnn/large/conv4_9x9/Relu"
  op: "Relu"
  input: "mcnn/large/conv4_9x9/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mcnn/large/Maximum_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "mcnn/large/Maximum_3"
  op: "Maximum"
  input: "mcnn/large/conv4_9x9/Relu"
  input: "mcnn/large/Maximum_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mcnn/medium/conv1_7x7/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv1_7x7/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\007\000\000\000\007\000\000\000\003\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "mcnn/medium/conv1_7x7/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv1_7x7/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.07296484708786011
      }
    }
  }
}
node {
  name: "mcnn/medium/conv1_7x7/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv1_7x7/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.07296484708786011
      }
    }
  }
}
node {
  name: "mcnn/medium/conv1_7x7/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "mcnn/medium/conv1_7x7/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv1_7x7/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "mcnn/medium/conv1_7x7/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "mcnn/medium/conv1_7x7/weights/Initializer/random_uniform/max"
  input: "mcnn/medium/conv1_7x7/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv1_7x7/weights"
      }
    }
  }
}
node {
  name: "mcnn/medium/conv1_7x7/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "mcnn/medium/conv1_7x7/weights/Initializer/random_uniform/RandomUniform"
  input: "mcnn/medium/conv1_7x7/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv1_7x7/weights"
      }
    }
  }
}
node {
  name: "mcnn/medium/conv1_7x7/weights/Initializer/random_uniform"
  op: "Add"
  input: "mcnn/medium/conv1_7x7/weights/Initializer/random_uniform/mul"
  input: "mcnn/medium/conv1_7x7/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv1_7x7/weights"
      }
    }
  }
}
node {
  name: "mcnn/medium/conv1_7x7/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv1_7x7/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 7
        }
        dim {
          size: 7
        }
        dim {
          size: 3
        }
        dim {
          size: 20
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "mcnn/medium/conv1_7x7/weights/Assign"
  op: "Assign"
  input: "mcnn/medium/conv1_7x7/weights"
  input: "mcnn/medium/conv1_7x7/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv1_7x7/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "mcnn/medium/conv1_7x7/weights/read"
  op: "Identity"
  input: "mcnn/medium/conv1_7x7/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv1_7x7/weights"
      }
    }
  }
}
node {
  name: "mcnn/medium/conv1_7x7/biases/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv1_7x7/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "mcnn/medium/conv1_7x7/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv1_7x7/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "mcnn/medium/conv1_7x7/biases/Assign"
  op: "Assign"
  input: "mcnn/medium/conv1_7x7/biases"
  input: "mcnn/medium/conv1_7x7/biases/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv1_7x7/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "mcnn/medium/conv1_7x7/biases/read"
  op: "Identity"
  input: "mcnn/medium/conv1_7x7/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv1_7x7/biases"
      }
    }
  }
}
node {
  name: "mcnn/medium/conv1_7x7/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "mcnn/medium/conv1_7x7/Conv2D"
  op: "Conv2D"
  input: "Placeholder"
  input: "mcnn/medium/conv1_7x7/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "mcnn/medium/conv1_7x7/BiasAdd"
  op: "BiasAdd"
  input: "mcnn/medium/conv1_7x7/Conv2D"
  input: "mcnn/medium/conv1_7x7/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "mcnn/medium/conv1_7x7/Relu"
  op: "Relu"
  input: "mcnn/medium/conv1_7x7/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mcnn/medium/Maximum/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "mcnn/medium/Maximum"
  op: "Maximum"
  input: "mcnn/medium/conv1_7x7/Relu"
  input: "mcnn/medium/Maximum/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mcnn/medium/conv2_7x7/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv2_7x7/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000\024\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "mcnn/medium/conv2_7x7/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv2_7x7/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.06324554979801178
      }
    }
  }
}
node {
  name: "mcnn/medium/conv2_7x7/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv2_7x7/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.06324554979801178
      }
    }
  }
}
node {
  name: "mcnn/medium/conv2_7x7/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "mcnn/medium/conv2_7x7/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv2_7x7/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "mcnn/medium/conv2_7x7/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "mcnn/medium/conv2_7x7/weights/Initializer/random_uniform/max"
  input: "mcnn/medium/conv2_7x7/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv2_7x7/weights"
      }
    }
  }
}
node {
  name: "mcnn/medium/conv2_7x7/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "mcnn/medium/conv2_7x7/weights/Initializer/random_uniform/RandomUniform"
  input: "mcnn/medium/conv2_7x7/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv2_7x7/weights"
      }
    }
  }
}
node {
  name: "mcnn/medium/conv2_7x7/weights/Initializer/random_uniform"
  op: "Add"
  input: "mcnn/medium/conv2_7x7/weights/Initializer/random_uniform/mul"
  input: "mcnn/medium/conv2_7x7/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv2_7x7/weights"
      }
    }
  }
}
node {
  name: "mcnn/medium/conv2_7x7/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv2_7x7/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 20
        }
        dim {
          size: 40
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "mcnn/medium/conv2_7x7/weights/Assign"
  op: "Assign"
  input: "mcnn/medium/conv2_7x7/weights"
  input: "mcnn/medium/conv2_7x7/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv2_7x7/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "mcnn/medium/conv2_7x7/weights/read"
  op: "Identity"
  input: "mcnn/medium/conv2_7x7/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv2_7x7/weights"
      }
    }
  }
}
node {
  name: "mcnn/medium/conv2_7x7/biases/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv2_7x7/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 40
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "mcnn/medium/conv2_7x7/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv2_7x7/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 40
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "mcnn/medium/conv2_7x7/biases/Assign"
  op: "Assign"
  input: "mcnn/medium/conv2_7x7/biases"
  input: "mcnn/medium/conv2_7x7/biases/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv2_7x7/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "mcnn/medium/conv2_7x7/biases/read"
  op: "Identity"
  input: "mcnn/medium/conv2_7x7/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@mcnn/medium/conv2_7x7/biases"
      }
    }
  }
}
node {
  name: "mcnn/medium/conv2_7x7/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "mcnn/medium/conv2_7x7/Conv2D"
  op: "Conv2D"
  input: "mcnn/medium/Maximum"
  input: "mcnn/medium/conv2_7x7/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
